Hướng dịch vụ/Đề thi/Huong dich vu/DeSo2wsdl.xml

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2-hudson-740-. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2-hudson-740-. -->
<definitions
        xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
        xmlns:tns="http://webService/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://webService/" name="DeSo2ImplService">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://webService/" schemaLocation="http://localhost:8080/OnThi/DeSo2Impl?xsd=1"/>
        </xsd:schema>
    </types>
    <message name="addItem">
        <part name="parameters" element="tns:addItem"/>
    </message>
    <message name="addItemResponse">
        <part name="parameters" element="tns:addItemResponse"/>
    </message>
    <message name="setNumber">
        <part name="parameters" element="tns:setNumber"/>
    </message>
    <message name="setNumberResponse">
        <part name="parameters" element="tns:setNumberResponse"/>
    </message>
    <portType name="DeSo2">
        <operation name="addItem">
            <input wsam:Action="http://webService/DeSo2/addItemRequest" message="tns:addItem"/>
            <output wsam:Action="http://webService/DeSo2/addItemResponse" message="tns:addItemResponse"/>
        </operation>
        <operation name="setNumber">
            <input wsam:Action="http://webService/DeSo2/setNumberRequest" message="tns:setNumber"/>
            <output wsam:Action="http://webService/DeSo2/setNumberResponse" message="tns:setNumberResponse"/>
        </operation>
    </portType>
    <binding name="DeSo2ImplPortBinding" type="tns:DeSo2">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="addItem">
            <soap:operation soapAction=""/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
        <operation name="setNumber">
            <soap:operation soapAction=""/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="DeSo2ImplService">
        <port name="DeSo2ImplPort" binding="tns:DeSo2ImplPortBinding">
            <soap:address location="http://localhost:8080/OnThi/DeSo2Impl"/>
        </port>
    </service>
</definitions>