Hướng dịch vụ/Đề thi/Huong dich vu/De2soap.xml

REQUEST
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webService/">
    <soapenv:Header/>
    <soapenv:Body>
        <web:setNumber>
            <number>?</number>
        </web:setNumber>
    </soapenv:Body>
</soapenv:Envelope>

RESPONSE
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
<S:Body>
    <ns2:setNumberResponse xmlns:ns2="http://webService/"/>
</S:Body>
</S:Envelope>